CSI API ETABS v1
cPropArea Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropArea
Public Interface cPropArea
Dim instance As cPropArea
public interface class cPropArea
type cPropArea =  interface end
The cPropArea type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of an existing area property.
Count
 Returns the total number of defined area properties in the model. If desired, counts can be returned for all area properties of a specified type in the model.
Delete
 Deletes a specified area property.
GetDeck
 Retrieves property data for a deck section.
GetDeck_1
 Retrieves property data for a deck section.
GetDeckFilled
 Retrieves property data for a filled deck section.
GetDeckSolidSlab
 Retrieves property data for a solid-slab deck section.
GetDeckUnfilled
 Retrieves property data for an unfilled deck section.
GetModifiers
 Retrieves the modifier assignments for an area property.
GetNameList
 Retrieves the names of all defined area properties of the specified type.
GetShellDesign
 Retrieves area property design parameters for a shell-type area section.
GetShellLayer
 Retrieves area property layer parameters for a shell-type area section.
GetShellLayer_1
 Retrieves area property layer parameters for a shell-type area section.
GetShellLayer_2
 Retrieves area property layer parameters for a shell-type area section.
GetSlab
 Retrieves property data for a slab section.
GetSlabRibbed
 Retrieves property data for a ribbed slab section.
GetSlabWaffle
 Retrieves property data for a waffle slab section.
GetTypeOAPI
 Retrieves the property type for the specified area property.
GetWall
 Retrieves property data for a wall section.
GetWallAutoSelectList
 Retrieves property data for an auto select list wall section.
SetDeck
 Initializes a deck property.
SetDeck_1
 Initializes a deck property.
SetDeckFilled
 Initializes a filled deck property
SetDeckSolidSlab
 Initializes a solid-slab deck property
SetDeckUnfilled
 Initializes an unfilled deck property
SetModifiers
 Assigns property modifiers to an area property.
SetShellDesign
 Assigns the design parameters for shell-type area properties.
SetShellLayer
 Assigns the layer parameters for shell-type area properties
SetShellLayer_1
 Assigns the layer parameters for shell-type area properties
SetShellLayer_2
 Assigns the layer parameters for shell-type area properties
SetSlab
 Initializes a slab property.
SetSlabRibbed
 Initializes a ribbed slab section.
SetSlabWaffle
 Initializes a waffle slab section.
SetWall
 Initializes property data for a wall section.
SetWallAutoSelectList
 Initializes property data for an auto select list wall section.
Top
See Also
Reference
ETABSv1 Namespace